Config/Catalogs/Calendars.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Calendars</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsPerPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/CalendarDays.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CalendarDays</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CalendarDayType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Timetable</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Timetables</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PriceTag</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTags</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPriceCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccountingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/CalendarDaysByRoomTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CalendarDaysByRoomTypes</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CalendarDayType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PriceTag</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTags</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPriceCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccountingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/CalendarDayTypesByLengthOfStay.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CalendarDayTypesByLengthOfStay</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CalendarDayType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>LengthOfStay</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/CalendarDayTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CalendarDayTypes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionTranslations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Discount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorHexString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Calendars/Ext/ObjectModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure // OnWrite

#EndRegion

#Region Public

// -----------------------------------------------------------------------------
//  Get list of calendar days with day types within given period
//
// Parameters:
//  pDateFrom		 - Date			 - DateFrom is mandatory
//  pDateTo			 - Date			 - DateTo is mandatory
//  pCheckInDate	 - Date			 - CheckInDate
//  pCheckOutDate	 - Date			 - CheckOutDate
//  pRoomType		 - CatalogRef.RoomTypes	 - Ref
// 
// Returns:
//  ValueTable - List calendar days
//
Function pmGetDays(pDateFrom, pDateTo, pCheckInDate = Undefined, pCheckOutDate = Undefined, pRoomType = Undefined, pPriceCalculationDate = '00010101') Export
	// Common checks	
	If Not ValueIsFilled(pDateFrom) Then
		Raise(NStr("en='ERR: Error calling Calendar.pmGetDays function.
		               |CAUSE: Empty pDateFrom parameter value was passed to the function.
					   |DESC: Mandatory parameter pDateFrom should be filled.';
				   |ru='ERR: Ошибка вызова функции Calendar.pmGetDays.
					   |CAUSE: В функцию передано пустое значение параметра pDateFrom.
					   |DESC: Обязательный параметр pDateFrom должен быть явно указан.';
				   |de='ERR: Fehler bei Aufruf der Funktion Calendar.pmGetDays
				       |CAUSE: In die Funktion wurde ein leerer Wert des Parameters pDateFrom übertragen.
					   |DESC: Das Pflichtparameter pDateFrom muss eindeutig angegeben sein.'"));
	EndIf;
	If Not ValueIsFilled(pDateTo) Then
		Raise(NStr("en='ERR: Error calling Calendar.pmGetDays function.
		               |CAUSE: Empty pDateTo parameter value was passed to the function.
					   |DESC: Mandatory parameter pDateTo should be filled.';
				   |ru='ERR: Ошибка вызова функции Calendar.pmGetDays.
				       |CAUSE: В функцию передано пустое значение параметра pDateTo.
					   |DESC: Обязательный параметр pDateTo должен быть явно указан.';
				   |de='ERR: Fehler bei Aufruf der Funktion Calendar.pmGetDays
				       |CAUSE: In die Funktion wurde ein leerer Wert des Parameters pDateTo übertragen.
					   |DESC: Das Pflichtparameter pDateTo muss eindeutig angegeben sein.'"));
	EndIf;
	vCheckInDate = pCheckInDate;
	If Not ValueIsFilled(vCheckInDate) Then
		vCheckInDate = pDateFrom;
	EndIf;
	vCheckOutDate = pCheckOutDate;
	If Not ValueIsFilled(vCheckOutDate) Then
		vCheckOutDate = pDateTo;
	EndIf;
	
	// Build and run query to get calendar days
	qGetDays = New Query();
	If IsPerPeriod Then
		qGetDays.Text = 
		"SELECT
		|	CalendarDays.AccountingDate AS Period,
		|	CalendarDays.Calendar AS Calendar,
		|	CalendarDays.CalendarDayType AS CalendarDayType,
		|	CalendarDays.CalendarDayType.SortCode AS CalendarDayTypeSortCode,
		|	CalendarDays.Timetable AS Timetable,
		|	CalendarDays.PriceTag AS PriceTag,
		|	DATEDIFF(&qCheckInDate, &qCheckOutDate, DAY) AS LengthOfStay,
		|	CalendarDayTypesByLengthOfStay.CalendarDayType AS CalendarDayTypeByLengthOfStay,
		|	CalendarDayTypesByLengthOfStay.CalendarDayType.SortCode AS CalendarDayTypeByLengthOfStaySortCode,
		|	CalendarDayTypesByLengthOfStay.LengthOfStay AS LengthOfStayByLengthOfStay,
		|	CalendarDaysByRoomTypes.CalendarDayType AS CalendarDayTypeByRoomType,
		|	CalendarDaysByRoomTypes.RoomType AS RoomType
		|FROM
		|	InformationRegister.CalendarDays.SliceLast(
		|			&qPriceCalculationDate,
		|			AccountingDate BETWEEN &qDateFrom AND &qDateTo
		|				AND Calendar = &qCalendar) AS CalendarDays
		|		LEFT JOIN InformationRegister.CalendarDaysByRoomTypes.SliceLast(
		|				&qPriceCalculationDate,
		|				AccountingDate BETWEEN &qDateFrom AND &qDateTo
		|					AND Calendar = &qCalendar
		|					AND (&qRoomTypeIsUndefined
		|						OR NOT &qRoomTypeIsUndefined
		|							AND RoomType = &qRoomType)) AS CalendarDaysByRoomTypes
		|		ON CalendarDays.Calendar = CalendarDaysByRoomTypes.Calendar
		|			AND CalendarDays.AccountingDate = CalendarDaysByRoomTypes.AccountingDate
		|		LEFT JOIN InformationRegister.CalendarDayTypesByLengthOfStay AS CalendarDayTypesByLengthOfStay
		|		ON CalendarDays.Calendar = CalendarDayTypesByLengthOfStay.Calendar
		|			AND (DATEDIFF(&qCheckInDate, &qCheckOutDate, DAY) >= CalendarDayTypesByLengthOfStay.LengthOfStay)
		|			AND (CalendarDayTypesByLengthOfStay.CalendarDayType <> VALUE(Catalog.CalendarDayTypes.EmptyRef))
		|
		|ORDER BY
		|	CalendarDays.AccountingDate,
		|	LengthOfStayByLengthOfStay DESC";
	Else
		qGetDays.Text = 
		"SELECT
		|	CalendarDays.AccountingDate AS Period,
		|	CalendarDays.Calendar AS Calendar,
		|	CalendarDays.CalendarDayType AS CalendarDayType,
		|	CalendarDays.CalendarDayType.SortCode AS CalendarDayTypeSortCode,
		|	CalendarDays.Timetable AS Timetable,
		|	CalendarDays.PriceTag AS PriceTag,
		|	DATEDIFF(&qCheckInDate, CalendarDays.AccountingDate, DAY) + 1 AS LengthOfStay,
		|	CalendarDayTypesByLengthOfStay.CalendarDayType AS CalendarDayTypeByLengthOfStay,
		|	CalendarDayTypesByLengthOfStay.CalendarDayType.SortCode AS CalendarDayTypeByLengthOfStaySortCode,
		|	CalendarDayTypesByLengthOfStay.LengthOfStay AS LengthOfStayByLengthOfStay,
		|	CalendarDaysByRoomTypes.CalendarDayType AS CalendarDayTypeByRoomType,
		|	CalendarDaysByRoomTypes.RoomType AS RoomType
		|FROM
		|	InformationRegister.CalendarDays.SliceLast(
		|			&qPriceCalculationDate,
		|			AccountingDate BETWEEN &qDateFrom AND &qDateTo
		|				AND Calendar = &qCalendar) AS CalendarDays
		|		LEFT JOIN InformationRegister.CalendarDaysByRoomTypes.SliceLast(
		|				&qPriceCalculationDate,
		|				AccountingDate BETWEEN &qDateFrom AND &qDateTo
		|					AND Calendar = &qCalendar
		|					AND (&qRoomTypeIsUndefined
		|						OR NOT &qRoomTypeIsUndefined
		|							AND RoomType = &qRoomType)) AS CalendarDaysByRoomTypes
		|		ON CalendarDays.Calendar = CalendarDaysByRoomTypes.Calendar
		|			AND CalendarDays.AccountingDate = CalendarDaysByRoomTypes.AccountingDate
		|		LEFT JOIN InformationRegister.CalendarDayTypesByLengthOfStay AS CalendarDayTypesByLengthOfStay
		|		ON CalendarDays.Calendar = CalendarDayTypesByLengthOfStay.Calendar
		|			AND (DATEDIFF(&qCheckInDate, CalendarDays.AccountingDate, DAY) + 1 >= CalendarDayTypesByLengthOfStay.LengthOfStay)
		|			AND (CalendarDayTypesByLengthOfStay.CalendarDayType <> VALUE(Catalog.CalendarDayTypes.EmptyRef))
		|
		|ORDER BY
		|	CalendarDays.AccountingDate,
		|	LengthOfStayByLengthOfStay DESC";
	EndIf;
	qGetDays.SetParameter("qCalendar", Ref);
	qGetDays.SetParameter("qPriceCalculationDate", ?(ValueIsFilled(pPriceCalculationDate), pPriceCalculationDate, CurrentSessionDate()));
	qGetDays.SetParameter("qRoomType", pRoomType);
	qGetDays.SetParameter("qRoomTypeIsUndefined", pRoomType = Undefined);
	qGetDays.SetParameter("qDateFrom", BegOfDay(pDateFrom));
	qGetDays.SetParameter("qDateTo", pDateTo);
	qGetDays.SetParameter("qCheckInDate", BegOfDay(vCheckInDate));
	qGetDays.SetParameter("qCheckOutDate", BegOfDay(vCheckOutDate));
	vDays = qGetDays.Execute().Unload();
	
	// Remove join extended rows and set resulting calendar day type by comparing weights of both
	If vDays.Count() > 0 Then
		If vDays.Count() > 1 Then
			i = 0;
			While i < (vDays.Count() - 1) Do
				vCurRow = vDays.Get(i);
				If ValueIsFilled(vCurRow.CalendarDayType) And ValueIsFilled(vCurRow.CalendarDayTypeByLengthOfStay) Then
					If vCurRow.CalendarDayTypeByLengthOfStay.Weight >= vCurRow.CalendarDayType.Weight Then
						vCurRow.CalendarDayType = vCurRow.CalendarDayTypeByLengthOfStay;
						vCurRow.CalendarDayTypeSortCode = vCurRow.CalendarDayTypeByLengthOfStaySortCode;
					EndIf;
				EndIf;
				vNextRow = vDays.Get(i + 1);
				If vCurRow.Period = vNextRow.Period And vCurRow.LengthOfStay = vNextRow.LengthOfStay Then
					vDays.Delete(i + 1);
				Else
					i = i + 1;
				EndIf;
			EndDo;
		Else
			vCurRow = vDays.Get(0);
			If ValueIsFilled(vCurRow.CalendarDayType) And ValueIsFilled(vCurRow.CalendarDayTypeByLengthOfStay) Then
				If vCurRow.CalendarDayTypeByLengthOfStay.Weight >= vCurRow.CalendarDayType.Weight Then
					vCurRow.CalendarDayType = vCurRow.CalendarDayTypeByLengthOfStay;
					vCurRow.CalendarDayTypeSortCode = vCurRow.CalendarDayTypeByLengthOfStaySortCode;
				EndIf;
			EndIf;
		EndIf;
	EndIf;
	
	// Return
	Return vDays;
EndFunction // pmGetDays

// -----------------------------------------------------------------------------
//  Get list of calendar days with given day type
//
// Parameters:
//  pDayType	 - CatalogRef.CalendarDayTypes	 - Ref
//  pDateFrom	 - Date							 - Date
// 
// Returns:
//  ValueTable - List calendar days type
//
Function pmGetDaysByDayType(pDayType, pDateFrom = '00010101', pPriceCalculationDate = '00010101') Export
	// Build and run query to get calendar days
	qGetDays = New Query();
	qGetDays.Text = 
	"SELECT
	|	CalendarDays.AccountingDate AS Period,
	|	CalendarDays.Calendar AS Calendar,
	|	CalendarDays.CalendarDayType AS CalendarDayType
	|FROM
	|	InformationRegister.CalendarDays.SliceLast(
	|			&qPriceCalculationDate,
	|			Calendar = &qCalendar
	|				AND CalendarDayType = &qDayType
	|				AND AccountingDate >= &qDateFrom) AS CalendarDays
	|
	|ORDER BY
	|	CalendarDays.AccountingDate";
	qGetDays.SetParameter("qCalendar", Ref);
	qGetDays.SetParameter("qDayType", pDayType);
	qGetDays.SetParameter("qDateFrom", BegOfDay(pDateFrom));
	qGetDays.SetParameter("qPriceCalculationDate", ?(ValueIsFilled(pPriceCalculationDate), pPriceCalculationDate, CurrentSessionDate()));
	vDays = qGetDays.Execute().Unload();
	// Return
	Return vDays;
EndFunction // pmGetDaysByDayType

#EndRegion
